source="bruteforce_sample_mixed.json" sourcetype="_json" EventID="4625"
| bin _time span=1h
| stats count as failed_attempts by IpAddress, UserName, _time
| where failed_attempts >= 3
| sort - failed_attempts
